
using UnityEngine;

public class Lessons_OOP : MonoBehaviour
{   
        //OOP
    //Абстракция: абстрактное поведение объектов обобщается в классах

    //Инкапсуляция данных: свойства и методы инкапсулируются в виде классов и скрыты от внешнего доступа.

    //Наследование: свойства и методы могут быть унаследованы одним классом от другого класса

    //Полиморфизм: множество форм - объекты могут принимать различные формы в зависимости от их использования

        //SOLID:

    //Single Responsibility Principle(Принцип единственной обязанности)

    //Open/Closed Principle(Принцип открытости/закрытости)

    //Liskov Substitution Principle(Принцип подстановки Лисков)

    //Interface Segregation Principle(Принцип разделения интерфейсов)

    //Dependency Inversion Principle(Принцип инверсии зависимостей)
}
